# GetRuleName Method (Int32) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..GetRuleName Method (Int32)
PerformanceAdviser Class See Also
---
Retrieves the name of the rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string GetRuleName(
	int index
)
```

Visual Basic
---
```text
Public Function GetRuleName ( _
	index As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetRuleName(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The rule index to get information for.
# ### Return Value
The name of the rule.
# See Also
PerformanceAdviser Class
GetRuleName Overload
Autodesk.Revit.DB Namespace